clear
clc


x0=zeros(21,2);
for i=1:21
    
%     %%%%%%%%%%%%%%%%%%%%%%%%以下为调试部分,运行单次循环时使用
%     clear
%     clc
%     
%     x0=zeros(21,2);
%     i=10;
%     %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

    filename=[num2str(i),'.jpg'];%各帧图片名称
    A=imread(filename);%读入各帧图片
    X=A(500:600,500:1100,1:3);%截取图片中影子的大致区域
    
    XI=rgb2gray(X);%将真彩色图像 RGB 转换为灰度图像
    Xbw=im2bw(XI,0.85);%将灰度图像转换为二值图像，白色像素对应1，其他像素对应0，阈值为0.85，调试过程中获得，使得影子没有缺失
%     %%%%%%%%%%%%%%%%%%%%%%%%%%%%%下为阈值调整使用
%     imshow(Xbw);
%     imtool(X);
%     %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    L=bwlabel(~Xbw);%对二维二值图像中的连通分量进行标注
    index=L==L(25,125);%与底座为同一联通范围内则进行标注
    Xbw(~index)=1;
%   imshow(Xbw);
    for j=450:601%横坐标
        for k=1:101%纵坐标
            if Xbw(k,j)==0
                x0(i,1)=j;
                x0(i,2)=k;
            end
        end
    end
    imtool(X);
    
    imtool(Xbw);
    
end


%计算影子长度
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%调试部分
% Pbw=im2bw(XI,0.7);
% imtool(Pbw);
% 
% image(A);
% Y=A(100:600,550:700,:);
% YI=rgb2gray(Y);
% Ybw=im2bw(YI,0.38);
% imtool(Y)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
global time;%视频截取各帧对应的时间
global Acth;%实际长度，即视频中长度
global shichabiao

l=2/369.2;%单一像素的真实长度，
B=[85,18+5.66;139,18+5.66;83,28+6.06;141,28+6.06];%%%%%%%%%%%[82,22;139,22;80,36;141,36]，变换前底座的四个顶点
A=[84,0.86;140,0.86;84,56.86;140,56.86];%变换后底座的四个顶点，假设为正方形底座
TForm = cp2tform(B,A,'projective');%变换矩阵
x0trans=tformfwd(TForm,x0);%利用变换矩阵将影子进行变换
x0trans(:,1)=x0trans(:,1)-112;%横坐标影子端点至杆底端的距离
x0trans(:,2)=x0trans(:,2)-28.86;%纵坐标影子端点至杆底端的距离

Acth=l*(sum(x0trans.^2,2)).^0.5;%实际长度

% Acth(:,2)=[2.424024024 2.391081081 2.357837838 2.324834835...
% 2.315825826...
% 2.276546547 2.246546547 2.207417417 2.176066066 2.162462462...
% 2.121861862 2.105255255 2.09039039 2.054144144 2.027087087...
% 2.003063063 1.966996997 1.94 1.912942943 1.900900901...
% 1.876876877]';


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Acth=l*(sum(x0.^2,2)).^0.5;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%以下为遗传算法，参照第三问
time=xlsread('附件四时间','C1:C21');
shichabiao=xlsread('shicha','N1:N365');

nvars=3;%变量个数
lb=[0 0 -0.499999];
ub=[180 90 193.4999999];
PopulationSize_Data=200;
MaxGenerations_Data=600;
MaxStallGenerations_Data=150;
fval1=1;%评价值（适应度）

h=waitbar(0,'please wait');
j=100;%循环次数
for i=1:j
    [x fval]=gasolve4(nvars,lb,ub,PopulationSize_Data,MaxGenerations_Data,MaxStallGenerations_Data);
    if fval<fval1
        fval1=fval;
        x1=x;
    end
    waitbar(i/j,h)
end
delete(h);
x1
fval1